{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "model_left_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 34, 2048], "dtype": "float32", "sparse": false, "name": "model_left_input"}, "inbound_nodes": []}, {"name": "model_right_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 34], "dtype": "float32", "sparse": false, "name": "model_right_input"}, "inbound_nodes": []}, {"name": "model_left_Dense", "class_name": "Dense", "config": {"name": "model_left_Dense", "trainable": true, "batch_input_shape": [null, 34, 2048], "dtype": "float32", "units": 300, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["model_left_input", 0, 0, {}]]]}, {"name": "model_right_Embedding", "class_name": "Embedding", "config": {"name": "model_right_Embedding", "trainable": true, "batch_input_shape": [null, 34], "dtype": "float32", "input_dim": 10674, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 34}, "inbound_nodes": [[["model_right_input", 0, 0, {}]]]}, {"name": "model_middle_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 34, 2], "dtype": "float32", "sparse": false, "name": "model_middle_input"}, "inbound_nodes": []}, {"name": "model_middle_connect", "class_name": "Add", "config": {"name": "model_middle_connect", "trainable": true}, "inbound_nodes": [[["model_left_Dense", 0, 0, {}], ["model_right_Embedding", 0, 0, {}]]]}, {"name": "model_middle_Dense", "class_name": "Dense", "config": {"name": "model_middle_Dense", "trainable": true, "batch_input_shape": [null, 34, 2], "dtype": "float32", "units": 300, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["model_middle_input", 0, 0, {}]]]}, {"name": "model_style_connect", "class_name": "Add", "config": {"name": "model_style_connect", "trainable": true}, "inbound_nodes": [[["model_middle_connect", 0, 0, {}], ["model_middle_Dense", 0, 0, {}]]]}, {"name": "model_right_LSTM", "class_name": "LSTM", "config": {"name": "model_right_LSTM", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["model_style_connect", 0, 0, {}]]]}, {"name": "model_right_TimeDistributed", "class_name": "TimeDistributed", "config": {"name": "model_right_TimeDistributed", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 300, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["model_right_LSTM", 0, 0, {}]]]}, {"name": "model_new_Bidirectional", "class_name": "Bidirectional", "config": {"name": "model_new_Bidirectional", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["model_right_TimeDistributed", 0, 0, {}]]]}, {"name": "model_new_Dense", "class_name": "Dense", "config": {"name": "model_new_Dense", "trainable": true, "units": 10674, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["model_new_Bidirectional", 0, 0, {}]]]}, {"name": "batch_normalization_95", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_95", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["model_new_Dense", 0, 0, {}]]]}, {"name": "model_new_Activation", "class_name": "Activation", "config": {"name": "model_new_Activation", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["batch_normalization_95", 0, 0, {}]]]}], "input_layers": [["model_left_input", 0, 0], ["model_middle_input", 0, 0], ["model_right_input", 0, 0]], "output_layers": [["model_new_Activation", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of11.bin", "group1-shard2of11.bin", "group1-shard3of11.bin", "group1-shard4of11.bin", "group1-shard5of11.bin", "group1-shard6of11.bin", "group1-shard7of11.bin", "group1-shard8of11.bin", "group1-shard9of11.bin", "group1-shard10of11.bin", "group1-shard11of11.bin"], "weights": [{"name": "batch_normalization_95/gamma", "shape": [10674], "dtype": "float32"}, {"name": "batch_normalization_95/beta", "shape": [10674], "dtype": "float32"}, {"name": "batch_normalization_95/moving_mean", "shape": [10674], "dtype": "float32"}, {"name": "batch_normalization_95/moving_variance", "shape": [10674], "dtype": "float32"}, {"name": "model_left_Dense/kernel", "shape": [2048, 300], "dtype": "float32"}, {"name": "model_left_Dense/bias", "shape": [300], "dtype": "float32"}, {"name": "model_middle_Dense/kernel", "shape": [2, 300], "dtype": "float32"}, {"name": "model_middle_Dense/bias", "shape": [300], "dtype": "float32"}, {"name": "model_new_Bidirectional/forward_lstm_1/kernel", "shape": [300, 1024], "dtype": "float32"}, {"name": "model_new_Bidirectional/forward_lstm_1/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "model_new_Bidirectional/forward_lstm_1/bias", "shape": [1024], "dtype": "float32"}, {"name": "model_new_Bidirectional/backward_lstm_1/kernel", "shape": [300, 1024], "dtype": "float32"}, {"name": "model_new_Bidirectional/backward_lstm_1/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "model_new_Bidirectional/backward_lstm_1/bias", "shape": [1024], "dtype": "float32"}, {"name": "model_new_Dense/kernel", "shape": [512, 10674], "dtype": "float32"}, {"name": "model_new_Dense/bias", "shape": [10674], "dtype": "float32"}, {"name": "model_right_Embedding/embeddings", "shape": [10674, 300], "dtype": "float32"}, {"name": "model_right_LSTM/kernel", "shape": [300, 1024], "dtype": "float32"}, {"name": "model_right_LSTM/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "model_right_LSTM/bias", "shape": [1024], "dtype": "float32"}, {"name": "model_right_TimeDistributed/kernel", "shape": [256, 300], "dtype": "float32"}, {"name": "model_right_TimeDistributed/bias", "shape": [300], "dtype": "float32"}]}]}